{
    "name": "Siddharth Kalelkar",
    "phone_number": "+447961998822",
    "email": "Sid.Kalelkar@GMail.com",
    "designation": null,
    "skills": ".Net; API; ASP.Net; Agile; Agile/Scrum; Agile/Scrum methodology; Android; AngularJS; C; C#; Finance; Informatica; Java; Kanban; Middleware; MySql; PHP; PRINCE2; Platform; Procurement; Retail; SAs; SCRUM; SKILLS; Scala; Scrum; SiteCore; Software development; Sql; Supply Chain; User Stories; Windows; iOS; requirement gathering; skills; stakeholder management; user stories; workshops",
    "nationality": "",
    "education": [],
    "projects": [
        "techniques, Change, multiple external vendor/supplier management and overall project management.",
        "Engaging in NatWest's Project for revamp of Mobile App to digitize Notifications;",
        "Engaging in YW's YorBill Project for complete revamp of legacy Billing System to Digital;",
        "Engaging in NHSBSA's Immigration Health Surcharge Project for the Covid19 Portal;",
        "Extending the Project onto Mobile (Android/iOS) App;",
        "Engaging in Cargill's \"classified and high",
        "Training at all levels (teams, project managers, business analysts, executives, stakeholders, etc);",
        "Agile transformation; Coaching, based on the context of the organization and project landscape;",
        "Software Dev and Technical Delivery for Multi",
        "Project awarded the Digital Britain Award 2014 at \"The Digitals\" for Best Customer & User",
        "Capita UK plc Agile Project Manager",
        "IBM UK plc (Jaguar Land Rover) IT Project Manager",
        "Managing project life cycle per PRINCE2"
    ],
    "past_companies": [
        "Digital Consulting With"
    ],
    "certifications": [
        "Training",
        "Certified",
        "Certification"
    ],
    "date_of_birth": null,
    "location": "Northampton",
    "languages": null,
    "linkedin": null,
    "websites": [],
    "is_resume_probability": 75.0,
    "redacted_text": false,
    "objective": null,
    "profession": "Manager",
    "summary": "Siddharth Kalelkar is a Certified Scrum Professional (CSP-PM) He is also a Certified Agile Coach (CSM) and a Certified Team Kanban Practitioner (TKP) He has a B.Sc. (Chem) degree.",
    "publications": null,
    "referees": [],
    "total_experience": null,
    "work_experience": [
        "(Chem)\nSKILLS AND EXPERIENCE SUMMARY\no",
        "o Supplier management; vendor selection, vetting, validating\no Structured techniques: Requirements, design, system, integration, delivery and UAT\no Establishing standards, procedures, practices and disciplines for development of solutions\no Building teams and developing, Mentoring and Training individuals\no Environment experience; Internet / Intranet, Client Server, Windows, Unix\no Platform experience: Microsoft Stack, Java Stack, OpenSource, Mobile (Android, iOS, Windows, BB)\nPersonal Profile\nMy strength is in lifecycle management (SDLC) from conception through to implementation.",
        "Having gained extensive\nexperience of running multi-supplier business developments, including international projects, have excellent understanding\nof business requirements gained over years of experience encompassing business process, systems design, structured\ntechniques, Change, multiple external vendor/supplier management and overall project management.",
        "● Vast experience as Principal Digital Delivery Lead, Agile Coach & Scrum Master in software product\ndevelopment, working with cross functional teams, with excellent motivational and teamwork skills\n● Strong communicator and excellent stakeholder management skills - with all levels from Techies to CEOs\n● Coached and mentored Teams in Agile Scrum development, manage conflicts and facilitate discussion with an\nattitude of transparency\n● Experience in managing delivery of e-Commerce, Corporate and responsive web applications, managing large\nintegration projects (with the use of web services across multiple applications and teams)\n● Projects within an Agile environment, across multiple teams and delivering multiple international projects\nEmployment History\nKiraya Digital Agile Delivery Manager & Aug 2022 – Dec 2022\nSenior Scrum Master\n",
        "Maintaining and managing Stakeholders;\n Interface between “Business” and “Tech”, work with PO to ‘translate’ business requirements into User Stories;\nPublicis Sapient Senior Digital Delivery Manager & Oct 2018 – Jun 2019\nAgile Coach – Agile Programme\nManagement\nFacilitating Publicis Sapient's Digital & Innovation vision Change & Transformation strategy,\ninnovation lab enablement, and immersive digital experiences; coaching and facilitating the\ngrowth of the Agile Practice, within various sectors like Retail, Finance, et al, at one of the\nworld's unique consulting, technology and outsourcing companies in Digital Consulting with\nover 16,000+ employees spread across 60",
        "Team achieved “highest-ever” velocity for 2018-19 under my tutelage;\nCapgemini UK plc Lead Digital Agile Delivery Aug 2016 – Jul 2018\nManager & Senior Agile Coach\nFacilitating Capgemini's Digital & Innovation vision and portfolio strategy, value proposition,\ninnovation lab enablement, and immersive digital experiences; coaching and facilitating the\ngrowth of the Agile Practice, and especially within the Public Sector Digital & DevOps Unit (the\nPSDDO Unit) at one of the world's largest consulting, technology and outsourcing companies\nwith over 180,000 employees spread across 44 countries around the world.",
        "Project awarded the Digital Britain Award 2014 at “The Digitals” for Best Customer & User\nExperience\nParallel Minds Technologies Ltd Senior Delivery Lead, Agile Coach Nov 2012 – May 2014\n(Apple-Etisalat, Dubai/UAE) & Senior Scrum Master\n"
    ]
}